seekdoc-api/app/graphql/types/query_type.rb

    def all_user_favorite
      UserFavorite.all
---
SELECT "user_favorites".* FROM "user_favorites" ORDER BY "user_favorites"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def user_favorite(id:)
      UserFavorite.find(id)
---
SELECT "user_favorites".* FROM "user_favorites" WHERE "user_favorites"."user_id" = ? LIMIT ?  [["user_id", nil], ["LIMIT", 1]]