seekdoc-api/app/graphql/mutations/create_doctor.rb

INSERT INTO "doctors" ("first_name", "last_name", "gender", "bio", "location_lat", "location_long", "location_name", "location_street", "location_city", "location_state", "location_zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def resolve(first_name: , last_name:, gender:, bio:, location_lat:, location_long:,
                location_name:, location_street:, location_city:, location_state: , location_zip:)
      doctor = Doctor.new(first_name: first_name, last_name: last_name, gender: gender, bio: bio,
                          location_lat: location_lat, location_long: location_long,
                          location_name: location_name, location_street: location_street, location_city: location_city, location_state: location_state, location_zip: location_zip)
      if doctor.save