seekdoc-api/app/graphql/mutations/create_user_favorite.rb

INSERT INTO "user_favorites" ("user_id", "doctor_fn", "doctor_ln", "gender", "bio", "location_lat", "location_long", "location_name", "location_street", "location_city", "location_state", "location_zip", "rating", "review", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
                        rating: rating,
                        review: review
                        )
        if user_favorite.save